Revit 2026 API

# WallUtilsDisallowWallJoinAtEnd Method

---

Sets the wall's end not to join to other walls.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void DisallowWallJoinAtEnd(
	Wall wall,
	int end
)
```
```vb
Public Shared Sub DisallowWallJoinAtEnd (
	wall As Wall,
	end As Integer
)
```
```cpp
public:
static void DisallowWallJoinAtEnd(
	Wall^ wall,
	int end
)
```
```fsharp
static member DisallowWallJoinAtEnd :
        wall : Wall *
        end : int -> unit
```

#### Parameters

wall Wall
     The wall in question
end Int32
     0 or 1 for the beginning or end of the wall's curve

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If this wall is already joined at this end, it will become disconnected. If this wall is a stacked wall, all subwalls at this end will be disallowed to join.

#### Reference

WallUtils Class

Autodesk.Revit.DB Namespace